[
    {
        "title": "Software Engineer",
        "company": "Asynk.ai",
        "date": "2023-02 - Present",
        "skills": [
            "Next.js",
            "Javascript",
            "Typescript",
            "Styled component"
        ],
        "descriptions": [
            "Developed and deployed an online job search and tracking platform with Spring Boot and Next.js",
            "Applied tailwind CSS on front-end user interface and created customized design component for user experience",
            "Collaborated with UI designer and other developers to outline execution plans and participated in creating and prioritizing tasks with Jira"
        ]
    },
    {
        "title": "Software Engineer",
        "company": "Apoidea",
        "date": "2022-03 - 2023-06",
        "skills": [
            "TypeScript",
            "Nest.js",
            "MySQL",
            "MongoDB",
            "ActiveMQ",
            "Jest",
            "Mocha"
        ],
        "descriptions": [
            "Developed bank statement analysis service using Nest, MySQL, and MongoDB.",
            "Implemented over 100 bank statement analysis rules for accurate data representation and analysis.",
            "Refactored overcomplicated back-end designs by adopting Nest.js and largely saved back-end features",
            "Investigated business logic from source code for a top-tier bank client",
            "Performed a QA automation suite of over 2000 test cases with Jest for feature validation"
        ]
    },
    {
        "title": "Software Engineer",
        "company": "P L Technology Limited",
        "date": "2021-06 - 2022-02",
        "skills": [
            "Django",
            "Python",
            "React",
            "AWS",
            "PostgreSQL",
            "CodeBuild",
            "CodeDeploy"
        ],
        "descriptions": [
            "Led a team of 3 to architect and implement a loan platform utilizing ReactJS, Django, and PostgreSQL",
            "Managed the automated build and deployment pipeline utilizing AWS CodePipeline, CodeCommit, and CodeBuild",
            "Created and performed over 1000 automated unit tests with Unittest, expanding code coverage to 80%, minimized",
            "bugs introduced in new features deployment"
        ]
    },
    {
        "title": "Programmer (Part-time)",
        "company": "Technine",
        "date": "2021-03 - 2021-06",
        "skills": [
            "Next.js",
            "TypeScript",
            "Javascript",
            "MariaDB"
        ],
        "descriptions": [
            "Developed an E-commerce platform using Next.js, NodeJS and Express",
            "Built REST APIs to manage search and delete requests for over 1000 users using MariaDB database"
        ]
    }
]